In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [6]:
athlete_events = pd.read_csv('./data/athlete_events_clean.csv')
noc = pd.read_csv('./data/noc_regions_clean.csv')
summer = pd.read_csv('./data/summer_clean.csv')
country_dict = pd.read_csv('./data/country_dictionary.csv')

In [10]:
athlete_events.describe()

,ID,Age,Height,Weight,Year,Medal
count,266208.000000,266208.000000,266208.000000,266208.000000,266208.000000,266208.000000
mean,68233.783192,25.323781,175.435908,71.094734,1979.544281,0.287828
std,39031.466685,6.070495,9.957937,13.623307,28.831314,0.768095
min,1.000000,10.000000,127.000000,25.000000,1896.000000,0.000000
25%,34649.000000,22.000000,168.000000,62.000000,1964.000000,0.000000
50%,68169.000000,24.000000,176.000000,70.000000,1988.000000,0.000000
75%,102096.250000,28.000000,182.000000,79.000000,2004.000000,0.000000
max,135571.000000,96.000000,226.000000,214.000000,2016.000000,3.000000

In [13]:
athlete_events.head(1)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,0

In [19]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [16]:
athlete_events['Medal'].replace('Gold', 1, inplace=True)
athlete_events['Medal'].replace('Silver', 2, inplace=True)
athlete_events['Medal'].replace('Bronze', 3, inplace=True)

31161

In [8]:
len(athlete_events.loc[athlete_events['Medal'] == 3])

12883

In [ ]:
athlete_events.head()